app/Models/ActionModel.php

    public function getActionRequire()
    {
        try {
            $builder = $this->db->table('action_required ar'); // 👈 replace with your actual table name
            $builder->select('ar.*, at.action_desc');       // 👈 select fields (example)
            $builder->join('action_taken at', 'at.action_code = ar.reqaction_done', 'left'); // LEFT JOIN
            $builder->orderBy('ar.reqaction_desc', 'ASC');

            $result = $builder->get()->getResultArray();
---
SELECT `ar`.*, `at`.`action_desc`
FROM `action_required` `ar`
LEFT JOIN `action_taken` `at` ON `at`.`action_code` = `ar`.`reqaction_done`
WHERE ar.deleted_at IS NULL
ORDER BY `ar`.`reqaction_desc` ASC

   public function getActionByRequire($reqaction_code, $status = "Active")
    {
        try {
            $builder = $this->db->table('action_required'); // 👈 replace with your actual table name
            $builder->select('*');
            $builder->where('reqaction_code', $reqaction_code);
            $builder->where('act_rstatus', $status);

            $result = $builder->get()->getRowArray();
---
SELECT *
FROM `action_required`
WHERE `reqaction_code` = '00080'
AND `act_rstatus` = 'Active'