app/Models/ActionTakenModel.php

    public function get_action_taken_active(){

        try {
            $result = $this->where('act_tstatus', 'Active')->orderBy('action_desc', 'ASC')->findAll();
---
SELECT *
FROM `action_taken`
WHERE `act_tstatus` = 'Active'
AND `action_taken`.`deleted_at` IS NULL
ORDER BY `action_desc` ASC

    public function get_action_taken_all()
    {
        try {
            $result = $this->where('deleted_at IS NULL', null, false)->orderBy('action_desc', 'ASC')->findAll();
---
SELECT *
FROM `action_taken`
WHERE deleted_at IS NULL
AND `action_taken`.`deleted_at` IS NULL
ORDER BY `action_desc` ASC