app/Models/AuditTrailModel.php

    public function insertAuditTrailForUpdate($id, $table, $comparedData, $user)
    {

        // Insert a record into the audit trail table for each changed column
        foreach ($comparedData as $column => $change) {
            $this->insert([
                'trail_controlno' => $id,
                'trail_action' => 'UPDATE',
                'trail_table' => $table,
                'trail_column' => $column,
                'trail_old_value' => $change['old_value'],
                'trail_new_value' => $change['new_value'],
                'trail_date' => date('Y-m-d'),
                'trail_time' => date('H:i:s'),
                'trail_by' => $user,
                'trail_ip' => $_SERVER['REMOTE_ADDR'], // Get the IP address of the user
            ]);
---
INSERT INTO `audit_trail` (`trail_controlno`, `trail_action`, `trail_table`, `trail_column`, `trail_old_value`, `trail_new_value`, `trail_date`, `trail_time`, `trail_by`, `trail_ip`) VALUES ('AAECE5E697C6CF2', 'UPDATE', 'action_officer', 'status', 'I', 'A', '2025-08-27', '15:45:26', 'admin', '127.0.0.1')