app/Models/DocumentTypeModel.php

SELECT *
FROM `doc_type`
WHERE `status` = 'Active'
AND `doc_type`.`deleted_at` IS NULL
ORDER BY `type_desc` ASC
---
    public function getDocType(){

        $doctype = $this->where('status', 'Active')->orderBy('type_desc', 'ASC')->findAll();