app/Models/HolidayModel.php

SELECT *
FROM `holiday`
---
    public function getHoliday(){

        return $this->findAll();