app/Models/IncomingModel.php

SELECT *, `aof`.`officecode` AS `officecodes`
FROM `action_officer` `ao`
LEFT JOIN `action_office` `aof` ON `ao`.`empcode` = `aof`.`empcode`
WHERE `ao`.`empcode` = 'CARBILLONES'
---
    public function getOfficeCode($empcode){
        $builder = $this->db->table('action_officer ao');
        $builder->select('*');
        $builder->select('aof.officecode AS officecodes');
        $builder->join('action_office aof', 'ao.empcode = aof.empcode', 'left');
        $builder->where('ao.empcode', $empcode);

        $query = $builder->get();