app/Models/OfficeModel.php

    public function getOfficeDataById($officecode){

        return $this->find($officecode);
---
SELECT *
FROM `office`
WHERE `office`.`officecode` = '00608'

    public function getOfficeCode($empcode){
        $builder = $this->db->table('action_officer ao');
        $builder->select('*');
        $builder->select('aof.officecode AS officecodes');
        $builder->join('action_office aof', 'ao.empcode = aof.empcode', 'left');
        $builder->where('ao.empcode', $empcode);

        $query = $builder->get();
---
SELECT *, `aof`.`officecode` AS `officecodes`
FROM `action_officer` `ao`
LEFT JOIN `action_office` `aof` ON `ao`.`empcode` = `aof`.`empcode`
WHERE `ao`.`empcode` = 'CARBILLONES'

    public function getOfficeExceptCurrent($currentoffice){

        $result = $this->where('officecode !=', $currentoffice)
                       ->where('officecode !=', '00028')
                       ->where('regcode', '01')
                       ->orderBy('officename ASC')->findAll();
---
SELECT *
FROM `office`
WHERE `officecode` != '00602'
AND `officecode` != '00028'
AND `regcode` = '01'
ORDER BY `officename` ASC

    public function getOffice(){

        $result = $this->where('officecode !=', '00028')
                       ->where('regcode', '01')
                       ->orderBy('officename ASC')->findAll();
---
SELECT *
FROM `office`
WHERE `officecode` != '00028'
AND `regcode` = '01'
ORDER BY `officename` ASC