app/Models/UserModel.php

    public function getUsersByOffice($currentoffice){

        try {

            $builder = $this->db->table('action_officer ao');
            $builder->select('ao.empcode, ao.lastname, ao.firstname, ao.middlename');
            $builder->join('action_office aof', 'ao.empcode = aof.empcode', 'left');
            $builder->where('aof.officecode', $currentoffice);
            $builder->where('aof.empcode !=', 'admin');
            $builder->where('ao.status', 'A');
            $builder->orderBy('ao.lastname ASC');
            $query = $builder->get();
---
SELECT `ao`.`empcode`, `ao`.`lastname`, `ao`.`firstname`, `ao`.`middlename`
FROM `action_officer` `ao`
LEFT JOIN `action_office` `aof` ON `ao`.`empcode` = `aof`.`empcode`
WHERE `aof`.`officecode` = '00613'
AND `aof`.`empcode` != 'admin'
AND `ao`.`status` = 'A'
ORDER BY `ao`.`lastname` ASC